IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_nvic_regs.xml
<module id="NVIC" HW_revision="" description="NVIC Registers">
	<register id="NVIC_ISER0" width="32" page="1" offset="0x100" internal="0" description="NVIC Interrupt Set Enable Register 0">
		<bitfield id="SETENA0" description="Set INTR0 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SETENA1" description="Set INTR1 Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SETENA2" description="Set INTR2 Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SETENA3" description="Set INTR3 Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SETENA4" description="Set INTR4 Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SETENA5" description="Set INTR5 Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SETENA6" description="Set INTR6 Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SETENA7" description="Set INTR7 Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SETENA8" description="Set INTR8 Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SETENA9" description="Set INTR9 Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SETENA10" description="Set INTR10 Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SETENA11" description="Set INTR11 Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SETENA12" description="Set INTR12 Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SETENA13" description="Set INTR13 Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SETENA14" description="Set INTR14 Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SETENA15" description="Set INTR15 Enable" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SETENA16" description="Set INTR16 Enable" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SETENA17" description="Set INTR17 Enable" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SETENA18" description="Set INTR18 Enable" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SETENA19" description="Set INTR19 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SETENA20" description="Set INTR20 Enable" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SETENA21" description="Set INTR21 Enable" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SETENA22" description="Set INTR22 Enable" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SETENA23" description="Set INTR23 Enable" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SETENA24" description="Set INTR24 Enable" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SETENA25" description="Set INTR25 Enable" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SETENA26" description="Set INTR26 Enable" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SETENA27" description="Set INTR27 Enable" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SETENA28" description="Set INTR28 Enable" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SETENA29" description="Set INTR29 Enable" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SETENA30" description="Set INTR30 Enable" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SETENA31" description="Set INTR31 Enable" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="NVIC_ISER1" width="32" page="1" offset="0x104" internal="0" description="NVIC Interrupt Set Enable Register 1">
		<bitfield id="SETENA32" description="Set INTR32 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SETENA33" description="Set INTR33 Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SETENA34" description="Set INTR34 Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SETENA35" description="Set INTR35 Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SETENA36" description="Set INTR36 Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SETENA37" description="Set INTR37 Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SETENA38" description="Set INTR38 Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SETENA39" description="Set INTR39 Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SETENA40" description="Set INTR40 Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SETENA41" description="Set INTR41 Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SETENA42" description="Set INTR42 Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SETENA43" description="Set INTR43 Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SETENA44" description="Set INTR44 Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SETENA45" description="Set INTR45 Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SETENA46" description="Set INTR46 Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SETENA47" description="Set INTR47 Enable" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SETENA48" description="Set INTR48 Enable" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SETENA49" description="Set INTR49 Enable" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SETENA50" description="Set INTR50 Enable" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SETENA51" description="Set INTR51 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SETENA52" description="Set INTR52 Enable" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SETENA53" description="Set INTR53 Enable" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SETENA54" description="Set INTR54 Enable" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SETENA55" description="Set INTR55 Enable" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SETENA56" description="Set INTR56 Enable" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SETENA57" description="Set INTR57 Enable" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SETENA58" description="Set INTR58 Enable" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SETENA59" description="Set INTR59 Enable" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SETENA60" description="Set INTR60 Enable" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SETENA61" description="Set INTR61 Enable" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SETENA62" description="Set INTR62 Enable" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SETENA63" description="Set INTR63 Enable" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
