IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_nvic_regs.xml
	<register id="NVIC_ICER0" width="32" page="1" offset="0x180" internal="0" description="NVIC Interrupt Clear Enable Register 0">
		<bitfield id="CLRENA0" description="Clear INTR0 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA1" description="Clear INTR1 Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA2" description="Clear INTR2 Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA3" description="Clear INTR3 Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA4" description="Clear INTR4 Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA5" description="Clear INTR5 Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA6" description="Clear INTR6 Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA7" description="Clear INTR7 Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA8" description="Clear INTR8 Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA9" description="Clear INTR9 Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA10" description="Clear INTR10 Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA11" description="Clear INTR11 Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA12" description="Clear INTR12 Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA13" description="Clear INTR13 Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA14" description="Clear INTR14 Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA15" description="Clear INTR15 Enable" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA16" description="Clear INTR16 Enable" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA17" description="Clear INTR17 Enable" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA18" description="Clear INTR18 Enable" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA19" description="Clear INTR19 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA20" description="Clear INTR20 Enable" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA21" description="Clear INTR21 Enable" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA22" description="Clear INTR22 Enable" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA23" description="Clear INTR23 Enable" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA24" description="Clear INTR24 Enable" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA25" description="Clear INTR25 Enable" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA26" description="Clear INTR26 Enable" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA27" description="Clear INTR27 Enable" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA28" description="Clear INTR28 Enable" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA29" description="Clear INTR29 Enable" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA30" description="Clear INTR30 Enable" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA31" description="Clear INTR31 Enable" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="NVIC_ICER1" width="32" page="1" offset="0x184" internal="0" description="NVIC Interrupt Clear Enable Register 1">
		<bitfield id="CLRENA32" description="Clear INTR32 Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA33" description="Clear INTR33 Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA34" description="Clear INTR34 Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA35" description="Clear INTR35 Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA36" description="Clear INTR36 Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA37" description="Clear INTR37 Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA38" description="Clear INTR38 Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA39" description="Clear INTR39 Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA40" description="Clear INTR40 Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA41" description="Clear INTR41 Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA42" description="Clear INTR42 Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA43" description="Clear INTR43 Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA44" description="Clear INTR44 Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA45" description="Clear INTR45 Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA46" description="Clear INTR46 Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA47" description="Clear INTR47 Enable" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA48" description="Clear INTR48 Enable" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA49" description="Clear INTR49 Enable" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA50" description="Clear INTR50 Enable" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA51" description="Clear INTR51 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA52" description="Clear INTR52 Enable" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA53" description="Clear INTR53 Enable" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA54" description="Clear INTR54 Enable" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA55" description="Clear INTR55 Enable" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA56" description="Clear INTR56 Enable" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA57" description="Clear INTR57 Enable" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA58" description="Clear INTR58 Enable" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA59" description="Clear INTR59 Enable" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA60" description="Clear INTR60 Enable" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA61" description="Clear INTR61 Enable" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA62" description="Clear INTR62 Enable" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CLRENA63" description="Clear INTR63 Enable" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="NVIC_ISPR0" width="32" page="1" offset="0x200" internal="0" description="NVIC Interrupt Set Pending Register 0">
		<bitfield id="SETPEND0" description="Set INTR0 Pending" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND1" description="Set INTR1 Pending" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND2" description="Set INTR2 Pending" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND3" description="Set INTR3 Pending" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND4" description="Set INTR4 Pending" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND5" description="Set INTR5 Pending" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND6" description="Set INTR6 Pending" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND7" description="Set INTR7 Pending" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND8" description="Set INTR8 Pending" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND9" description="Set INTR9 Pending" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND10" description="Set INTR10 Pending" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND11" description="Set INTR11 Pending" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND12" description="Set INTR12 Pending" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND13" description="Set INTR13 Pending" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND14" description="Set INTR14 Pending" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND15" description="Set INTR15 Pending" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND16" description="Set INTR16 Pending" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND17" description="Set INTR17 Pending" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND18" description="Set INTR18 Pending" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND19" description="Set INTR19 Pending" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND20" description="Set INTR20 Pending" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND21" description="Set INTR21 Pending" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND22" description="Set INTR22 Pending" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND23" description="Set INTR23 Pending" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND24" description="Set INTR24 Pending" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND25" description="Set INTR25 Pending" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND26" description="Set INTR26 Pending" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND27" description="Set INTR27 Pending" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND28" description="Set INTR28 Pending" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND29" description="Set INTR29 Pending" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND30" description="Set INTR30 Pending" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND31" description="Set INTR31 Pending" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
