IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_nvic_regs.xml
	<register id="NVIC_ISPR1" width="32" page="1" offset="0x204" internal="0" description="NVIC Interrupt Set Pending Register 1">
		<bitfield id="SETPEND32" description="Set INTR32 Pending" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND33" description="Set INTR33 Pending" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND34" description="Set INTR34 Pending" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND35" description="Set INTR35 Pending" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND36" description="Set INTR36 Pending" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND37" description="Set INTR37 Pending" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND38" description="Set INTR38 Pending" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND39" description="Set INTR39 Pending" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND40" description="Set INTR40 Pending" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND41" description="Set INTR41 Pending" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND42" description="Set INTR42 Pending" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND43" description="Set INTR43 Pending" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND44" description="Set INTR44 Pending" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND45" description="Set INTR45 Pending" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND46" description="Set INTR46 Pending" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND47" description="Set INTR47 Pending" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND48" description="Set INTR48 Pending" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND49" description="Set INTR49 Pending" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND50" description="Set INTR50 Pending" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND51" description="Set INTR51 Pending" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND52" description="Set INTR52 Pending" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND53" description="Set INTR53 Pending" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND54" description="Set INTR54 Pending" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND55" description="Set INTR55 Pending" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND56" description="Set INTR56 Pending" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND57" description="Set INTR57 Pending" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND58" description="Set INTR58 Pending" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND59" description="Set INTR59 Pending" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND60" description="Set INTR60 Pending" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND61" description="Set INTR61 Pending" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND62" description="Set INTR62 Pending" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND63" description="Set INTR63 Pending" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="NVIC_ISPR2" width="32" page="1" offset="0x208" internal="0" description="NVIC Interrupt Set Pending Register 2">
		<bitfield id="SETPEND64" description="Set INTR64 Pending" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND65" description="Set INTR65 Pending" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND66" description="Set INTR66 Pending" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND67" description="Set INTR67 Pending" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND68" description="Set INTR68 Pending" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND69" description="Set INTR69 Pending" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND70" description="Set INTR70 Pending" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND71" description="Set INTR71 Pending" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND72" description="Set INTR72 Pending" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND73" description="Set INTR73 Pending" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND74" description="Set INTR74 Pending" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND75" description="Set INTR75 Pending" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND76" description="Set INTR76 Pending" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND77" description="Set INTR77 Pending" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND78" description="Set INTR78 Pending" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND79" description="Set INTR79 Pending" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND80" description="Set INTR80 Pending" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND81" description="Set INTR81 Pending" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND82" description="Set INTR82 Pending" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND83" description="Set INTR83 Pending" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND84" description="Set INTR84 Pending" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND85" description="Set INTR85 Pending" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND86" description="Set INTR86 Pending" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND87" description="Set INTR87 Pending" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND88" description="Set INTR88 Pending" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND89" description="Set INTR89 Pending" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND90" description="Set INTR90 Pending" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND91" description="Set INTR91 Pending" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND92" description="Set INTR92 Pending" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND93" description="Set INTR93 Pending" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND94" description="Set INTR94 Pending" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SETPEND95" description="Set INTR95 Pending" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
