IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_nvic_regs.xml
	<register id="NVIC_ICPR0" width="32" page="1" offset="0x280" internal="0" description="NVIC Interrupt Clear Pending Register 0">
		<bitfield id="CLRPEND0" description="Clear INTR0 Pending" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND1" description="Clear INTR1 Pending" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND2" description="Clear INTR2 Pending" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND3" description="Clear INTR3 Pending" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND4" description="Clear INTR4 Pending" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND5" description="Clear INTR5 Pending" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND6" description="Clear INTR6 Pending" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND7" description="Clear INTR7 Pending" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND8" description="Clear INTR8 Pending" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND9" description="Clear INTR9 Pending" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND10" description="Clear INTR10 Pending" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND11" description="Clear INTR11 Pending" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND12" description="Clear INTR12 Pending" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND13" description="Clear INTR13 Pending" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND14" description="Clear INTR14 Pending" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND15" description="Clear INTR15 Pending" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND16" description="Clear INTR16 Pending" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND17" description="Clear INTR17 Pending" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND18" description="Clear INTR18 Pending" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND19" description="Clear INTR19 Pending" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND20" description="Clear INTR20 Pending" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND21" description="Clear INTR21 Pending" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND22" description="Clear INTR22 Pending" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND23" description="Clear INTR23 Pending" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND24" description="Clear INTR24 Pending" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND25" description="Clear INTR25 Pending" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND26" description="Clear INTR26 Pending" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND27" description="Clear INTR27 Pending" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND28" description="Clear INTR28 Pending" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND29" description="Clear INTR29 Pending" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND30" description="Clear INTR30 Pending" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND31" description="Clear INTR31 Pending" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="NVIC_ICPR1" width="32" page="1" offset="0x284" internal="0" description="NVIC Interrupt Clear Pending Register 1">
		<bitfield id="CLRPEND32" description="Clear INTR32 Pending" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND33" description="Clear INTR33 Pending" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND34" description="Clear INTR34 Pending" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND35" description="Clear INTR35 Pending" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND36" description="Clear INTR36 Pending" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND37" description="Clear INTR37 Pending" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND38" description="Clear INTR38 Pending" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND39" description="Clear INTR39 Pending" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND40" description="Clear INTR40 Pending" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND41" description="Clear INTR41 Pending" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND42" description="Clear INTR42 Pending" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND43" description="Clear INTR43 Pending" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND44" description="Clear INTR44 Pending" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND45" description="Clear INTR45 Pending" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND46" description="Clear INTR46 Pending" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND47" description="Clear INTR47 Pending" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND48" description="Clear INTR48 Pending" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND49" description="Clear INTR49 Pending" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND50" description="Clear INTR50 Pending" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND51" description="Clear INTR51 Pending" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND52" description="Clear INTR52 Pending" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND53" description="Clear INTR53 Pending" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND54" description="Clear INTR54 Pending" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND55" description="Clear INTR55 Pending" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND56" description="Clear INTR56 Pending" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND57" description="Clear INTR57 Pending" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND58" description="Clear INTR58 Pending" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND59" description="Clear INTR59 Pending" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND60" description="Clear INTR60 Pending" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND61" description="Clear INTR61 Pending" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND62" description="Clear INTR62 Pending" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CLRPEND63" description="Clear INTR63 Pending" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="NVIC_IABR0" width="32" page="1" offset="0x300" internal="0" description="NVIC Interrupt Active Bit Register 0">
		<bitfield id="ACTIVE0" description="INTR0 Active" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE1" description="INTR1 Active" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE2" description="INTR2 Active" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE3" description="INTR3 Active" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE4" description="INTR4 Active" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE5" description="INTR5 Active" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE6" description="INTR6 Active" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE7" description="INTR7 Active" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE8" description="INTR8 Active" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE9" description="INTR9 Active" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE10" description="INTR10 Active" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE11" description="INTR11 Active" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE12" description="INTR12 Active" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE13" description="INTR13 Active" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE14" description="INTR14 Active" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE15" description="INTR15 Active" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE16" description="INTR16 Active" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE17" description="INTR17 Active" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE18" description="INTR18 Active" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE19" description="INTR19 Active" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE20" description="INTR20 Active" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE21" description="INTR21 Active" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE22" description="INTR22 Active" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE23" description="INTR23 Active" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE24" description="INTR24 Active" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE25" description="INTR25 Active" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE26" description="INTR26 Active" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE27" description="INTR27 Active" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE28" description="INTR28 Active" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE29" description="INTR29 Active" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE30" description="INTR30 Active" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE31" description="INTR31 Active" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="NVIC_IABR1" width="32" page="1" offset="0x304" internal="0" description="NVIC Interrupt Active Bit Register 1">
		<bitfield id="ACTIVE32" description="INTR32 Active" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE33" description="INTR33 Active" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE34" description="INTR34 Active" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE35" description="INTR35 Active" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE36" description="INTR36 Active" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE37" description="INTR37 Active" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE38" description="INTR38 Active" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE39" description="INTR39 Active" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE40" description="INTR40 Active" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE41" description="INTR41 Active" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE42" description="INTR42 Active" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE43" description="INTR43 Active" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE44" description="INTR44 Active" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE45" description="INTR45 Active" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE46" description="INTR46 Active" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE47" description="INTR47 Active" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE48" description="INTR48 Active" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE49" description="INTR49 Active" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE50" description="INTR50 Active" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE51" description="INTR51 Active" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE52" description="INTR52 Active" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE53" description="INTR53 Active" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE54" description="INTR54 Active" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE55" description="INTR55 Active" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE56" description="INTR56 Active" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE57" description="INTR57 Active" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE58" description="INTR58 Active" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE59" description="INTR59 Active" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE60" description="INTR60 Active" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE61" description="INTR61 Active" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE62" description="INTR62 Active" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="ACTIVE63" description="INTR63 Active" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="NVIC_IPR0" width="32" page="1" offset="0x400" internal="0" description="NVIC Interrupt Priority Register 0">
		<bitfield id="PRI_0" description="Priority, byte offset 0" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_1" description="Priority, byte offset 1" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_2" description="Priority, byte offset 2" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_3" description="Priority, byte offset 3" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
