IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_nvic_regs.xml
	<register id="NVIC_IPR1" width="32" page="1" offset="0x404" internal="0" description="NVIC Interrupt Priority Register 1">
		<bitfield id="PRI_4" description="Priority, byte offset 4" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_5" description="Priority, byte offset 5" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_6" description="Priority, byte offset 6" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_7" description="Priority, byte offset 7" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR2" width="32" page="1" offset="0x408" internal="0" description="NVIC Interrupt Priority Register 2">
		<bitfield id="PRI_8" description="Priority, byte offset 8" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_9" description="Priority, byte offset 9" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_10" description="Priority, byte offset 10" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_11" description="Priority, byte offset 11" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR3" width="32" page="1" offset="0x40c" internal="0" description="NVIC Interrupt Priority Register 3">
		<bitfield id="PRI_12" description="Priority, byte offset 12" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_13" description="Priority, byte offset 13" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_14" description="Priority, byte offset 14" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_15" description="Priority, byte offset 15" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR4" width="32" page="1" offset="0x410" internal="0" description="NVIC Interrupt Priority Register 4">
		<bitfield id="PRI_16" description="Priority, byte offset 16" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_17" description="Priority, byte offset 17" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_18" description="Priority, byte offset 18" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_19" description="Priority, byte offset 19" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR5" width="32" page="1" offset="0x414" internal="0" description="NVIC Interrupt Priority Register 5">
		<bitfield id="PRI_20" description="Priority, byte offset 20" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_21" description="Priority, byte offset 21" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_22" description="Priority, byte offset 22" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_23" description="Priority, byte offset 23" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR6" width="32" page="1" offset="0x418" internal="0" description="NVIC Interrupt Priority Register 6">
		<bitfield id="PRI_24" description="Priority, byte offset 24" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_25" description="Priority, byte offset 25" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_26" description="Priority, byte offset 26" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_27" description="Priority, byte offset 27" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR7" width="32" page="1" offset="0x41c" internal="0" description="NVIC Interrupt Priority Register 7">
		<bitfield id="PRI_28" description="Priority, byte offset 28" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_29" description="Priority, byte offset 29" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_30" description="Priority, byte offset 30" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_31" description="Priority, byte offset 31" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR8" width="32" page="1" offset="0x420" internal="0" description="NVIC Interrupt Priority Register 8">
		<bitfield id="PRI_32" description="Priority, byte offset 32" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_33" description="Priority, byte offset 33" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_34" description="Priority, byte offset 34" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_35" description="Priority, byte offset 35" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR9" width="32" page="1" offset="0x424" internal="0" description="NVIC Interrupt Priority Register 9">
		<bitfield id="PRI_36" description="Priority, byte offset 36" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_37" description="Priority, byte offset 37" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_38" description="Priority, byte offset 38" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_39" description="Priority, byte offset 39" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR10" width="32" page="1" offset="0x428" internal="0" description="NVIC Interrupt Priority Register 10">
		<bitfield id="PRI_40" description="Priority, byte offset 40" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_41" description="Priority, byte offset 41" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_42" description="Priority, byte offset 42" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_43" description="Priority, byte offset 43" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR11" width="32" page="1" offset="0x42c" internal="0" description="NVIC Interrupt Priority Register 11">
		<bitfield id="PRI_44" description="Priority, byte offset 44" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_45" description="Priority, byte offset 45" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_46" description="Priority, byte offset 46" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_47" description="Priority, byte offset 47" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR12" width="32" page="1" offset="0x430" internal="0" description="NVIC Interrupt Priority Register 12">
		<bitfield id="PRI_48" description="Priority, byte offset 48" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_49" description="Priority, byte offset 49" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_50" description="Priority, byte offset 50" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_51" description="Priority, byte offset 51" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR13" width="32" page="1" offset="0x434" internal="0" description="NVIC Interrupt Priority Register 13">
		<bitfield id="PRI_52" description="Priority, byte offset 52" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_53" description="Priority, byte offset 53" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_54" description="Priority, byte offset 54" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_55" description="Priority, byte offset 55" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR14" width="32" page="1" offset="0x438" internal="0" description="NVIC Interrupt Priority Register 14">
		<bitfield id="PRI_56" description="Priority, byte offset 56" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_57" description="Priority, byte offset 57" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_58" description="Priority, byte offset 58" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_59" description="Priority, byte offset 59" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="NVIC_IPR15" width="32" page="1" offset="0x43c" internal="0" description="NVIC Interrupt Priority Register 15">
		<bitfield id="PRI_60" description="Priority, byte offset 60" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="PRI_61" description="Priority, byte offset 61" begin="15" end="13" width="3" rwaccess="RW"/>
		<bitfield id="PRI_62" description="Priority, byte offset 62" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="PRI_63" description="Priority, byte offset 63" begin="31" end="29" width="3" rwaccess="RW"/>
	</register>
	<register id="STIR" width="32" page="1" offset="0xf00" internal="0" description="Software Trigger Interrupt Register">
		<bitfield id="INTID" description="Software Trigger Interrupt Register." begin="8" end="0" width="9" rwaccess="RW"/>
	</register>
</module>
